# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

fruits = ['дыня', 'груша', 'апельсин', 'лайм', 'ананас', 'киви']
n = 1
for i in fruits:
    print('{}: {:>6}'.format(n, i))
    n += 1

# Результат
# 1:     дыня
# 2:    груша
# 3: апельсин
# 4:     лайм
# 5:   ананас
# 6:     киви


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

list1 = [1, 2, 11, 560, 72, 'lol', 'for', 8, True]
list2 = [88, False, '72', True, 11, 32, 960, 1024, 'for']

print('list1:', list1)
print('list2:', list2)
n = 0
for i1 in list1:
    for i2 in list2:
        if i2 == i1 and type(i1) == type(i2):
            list1.pop(n)
    n += 1
print('Result:', list1)

# Результат
# list1: [1, 2, 11, 560, 72, 'lol', 'for', 8, True]
# list2: [88, False, '72', True, 11, 32, 960, 1024, 'for']
# Result: [1, 2, 560, 72, 'lol', 8]


# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

print('20, 44, 13, 22, 265, 16, 8, 77, 80, 43')
a = [20, 44, 13, 22, 265, 16, 8, 77, 80, 43]
b = []
for i in a:
    if i % 2:
        b.append(i * 2)
    else:
        b.append(i / 4)
print('a:', a)
print('b:', b)

# Результат
# 20, 44, 13, 22, 265, 16, 8, 77, 80, 43
# a: [20, 44, 13, 22, 265, 16, 8, 77, 80, 43]
# b: [5.0, 11.0, 26, 5.5, 530, 4.0, 2.0, 154, 20.0, 86]